Revit 2026 API

# ForgeTypeId(String) Constructor

---

Constructs a ForgeTypeId holding the given schema identifier.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ForgeTypeId(
	string typeId
)
```
```vb
Public Sub New (
	typeId As String
)
```
```cpp
public:
ForgeTypeId(
	String^ typeId
)
```
```fsharp
new :
        typeId : string -> ForgeTypeId
```

#### Parameters

typeId String

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

ForgeTypeId Class

ForgeTypeId Overload

Autodesk.Revit.DB Namespace